{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
  "createdDateTime": "2025-02-17T14:48:44.3659768Z",
  "creationSource": null,
  "description": "",
  "lastModifiedDateTime": "2025-02-17T14:48:44.3659768Z",
  "name": "Security Baseline 24H2 - Microsoft App Store",
  "platforms": "windows10",
  "priorityMetaData": null,
  "roleScopeTagIds": ["0"],
  "settingCount": 3,
  "technologies": "mdm",
  "id": "4500bf2c-b07f-4b72-a7e2-b3afd687a741",
  "templateReference": {
    "templateId": "",
    "templateFamily": "none",
    "templateDisplayName": null,
    "templateDisplayVersion": null
  },
  "settings": [
    {
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_applicationmanagement_allowgamedvr",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_applicationmanagement_allowgamedvr_0",
          "children": []
        }
      }
    },
    {
      "id": "1",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_applicationmanagement_msiallowusercontroloverinstall",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_applicationmanagement_msiallowusercontroloverinstall_0",
          "children": []
        }
      }
    },
    {
      "id": "2",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_applicationmanagement_msialwaysinstallwithelevatedprivileges",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_applicationmanagement_msialwaysinstallwithelevatedprivileges_0",
          "children": []
        }
      }
    }
  ]
}
